#Игра по мотивам Висельницы.
#Часть кода принадлежит М.Доусону.
#Игра была написана в оброзовательных целях.

import random

#константы:
HANGMAN = (
"""
---------
|       |
|
|
|
|
|
------------
""",
"""
---------
|       |
|       0
|
|
|
|
------------
""",
"""
---------
|       |
|       0
|       |
|
|
|
------------
""",
"""
---------
|       |
|       0
|     \-|-/
|
|
|
------------
""",
"""
---------
|       |
|       0
|     \-|-/
|       |
|
|
------------
""",
"""
---------
|       |
|       0
|     \-|-/
|       |
|
|
------------
""",
"""
---------
|       |
|       0
|     \-|-/
|       |
|      |
|
------------
""",
"""
---------
|       |
|       0
|     \-|-/
|       |
|      | |
|
------------
"""
)
MAX_WRONG = len(HANGMAN)-1
WORDS = ["OVER", "CLAM","SNOW","PYTHON","EGG","CAKE","CORE"]
word = random.choice(WORDS)
so_far = "-"*len(word) #набор дефисов, по одному на каждую букву
wrong = 0#Ошибки, допушеные игрокам(кол-во)
used=[]#буквы, которые игрок уже предлагал

print("Добро пожаловать в игру 'Висельница'. Удачи вам!")
while wrong != MAX_WRONG and so_far != word:
    print(HANGMAN[wrong])
    print("\nВы уже предлагали:\n", used)
    print("\nСлово сейчас выглядит так:\n", so_far)
    guess = input("Введите букву: ")
    guess = guess.upper()#переводим у верхнему регистру
    #проверка: не вводил ли игрок эту букву ранее
    while guess in used:
        print("Вы уже предлагали эту букву: ",guess, "Попробуйте ввести другую.")
        guess = input("\nВведите букву: ")
        guess = guess.upper()
    #добавляем букву к used
    used.append(guess)

    #проверка наличия буквы в слове
    if guess in word:
        print("Да! Буква", guess, "действительно находится в слове!")
    #новая строка so_far с отгаданой буквой в слове:
        new=""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new
    else:
        print("Буквы", guess, "нет в слове!")
        wrong += 1

    #завершение игры
if wrong == MAX_WRONG:
    print(HANGMAN[wrong])
    print("\nВас повесили!")
else:
    print("\nВы отгадали!")
print("\nБыло загадано слово", word)
input("\nНажмите Enter, чтобы выйти.")
